app/Http/Controllers/Api/V1/Admin/DashboardApiController.php

            $total_male_count = Gad::where('gender_id', '1')->count();
            $total_female_count = Gad::where('gender_id', '2')->count();

            $total_senior_count = GadItemDetails::whereHasMorph('item', [GovernmentAssistance::class], function ($query) {
                $query->where('item_id', 2);
            })->count();
---
select * from `government_assistance` where `government_assistance`.`deleted_at` is null