app/Http/Controllers/Api/V1/Admin/DashboardApiController.php

select * from `barangay` where `barangay`.`deleted_at` is null
select * from `gad` where `sector_id` = '1' and `gad`.`deleted_at` is null
select * from `gad` where `barangay_id` = 1 and `gad`.`deleted_at` is null
select count(*) as aggregate from `gad` where `gad`.`deleted_at` is null
---
    public function index()
    {
        abort_if(Gate::denies('dashboard_access'), Response::HTTP_FORBIDDEN, '403 Forbidden');

        $user_with_barangay = Auth::user()->barangay;

        if (isset($user_with_barangay)) {
            $total_people_count = Gad::where('barangay_id', $user_with_barangay)->count();
            $total_male_count = Gad::where('barangay_id', $user_with_barangay)->where('gender_id', '1')->count();
            $total_female_count = Gad::where('barangay_id', $user_with_barangay)->where('gender_id', '2')->count();

            // Total Senior
            $total_senior_count = GadItemDetails::whereHas(
                'gad',
                fn ($query) => $query->where('barangay_id', $user_with_barangay)
            )->whereHasMorph(
                'item',
                [Sector::class],
                function ($query) {
                    $query->where('item_id', 2);
                }
            )->count();
            //Senior Male
            $total_male_senior_count = GadItemDetails::whereHas(
                'gad',
                function ($query) use ($user_with_barangay) {
                    $query->where('barangay_id', $user_with_barangay);
                    $query->where('gender_id', 1);
                }
            )->whereHasMorph(
                'item',
                [Sector::class],
                function ($query) {
                    $query->where('item_id', 2);
                }
            )->count();