app/Http/Controllers/Api/V1/Admin/GadApiController.php

    public function edit($id)
    {
        $gad = Gad::with(['gender'])->find($id);
---
select * from `gender` where `gender`.`id` = '1' and `gender`.`deleted_at` is null limit 1