app/Http/Controllers/Api/V1/Admin/GadApiController.php

            function ($query) use ($user_with_barangay) {
                $query->where('barangay_id', $user_with_barangay);
            }
        )->get();

        foreach ($gad_search as $gad) {
            $barangay = Barangay::where('id', $gad->barangay_id)->first();
---
select * from `barangay` where `barangay`.`id` = '26' and `barangay`.`deleted_at` is null limit 1