app/Http/Controllers/Api/V1/Admin/GadApiController.php

    public function getName(Request $request)
    {
        $search = $request->query()['query'];
        $gad_search = Gad::orWhere('first_name', 'like', '%' . $search . '%')
            ->orWhere('last_name', 'like', '%' . $search . '%')
            ->orWhere('middle_name', 'like', '%' . $search . '%')
            ->get();

        foreach ($gad_search as $gad) {
            $barangay = Barangay::where('id', $gad->barangay_id)->first();
---
select * from `barangay` where `id` = '26' and `barangay`.`deleted_at` is null limit 1

    public function firstData(Request $request)
    {
        $relation_household = Household::all();
        $sex = Gender::all();
        $civil_status = CivilStatus::all();
        $religion = Religion::all();
        $gender_preference = GenderPreference::all();
        $valid_id = ValidID::all();
        $sector = Sector::all();
        $ethnicity = Ethnicity::all();
        $province = Province::all();
        $city = City::all();
        $purok = Purok::all();
        $sitio = Sitio::all();
        $educational_attaintment = EducationalAttaintment::all();
        $educational_status = EducationalStatus::all();
        $government_assistance = GovernmentAssistance::all();
        $organization = Organization::all();
        $work_location_city = City::all();
        $work_location_province = Province::all();
        $occupation = Occupation::all();
        $barangay = Barangay::all();
---
select * from `household` where `household`.`deleted_at` is null
select * from `gender` where `gender`.`deleted_at` is null
select * from `civil_status` where `civil_status`.`deleted_at` is null
select * from `religion` where `religion`.`deleted_at` is null
select * from `gender_preference` where `gender_preference`.`deleted_at` is null
select * from `sector` where `sector`.`deleted_at` is null
select * from `ethnicity` where `ethnicity`.`deleted_at` is null
select * from `province` where `province`.`deleted_at` is null
select * from `city` where `city`.`deleted_at` is null
select * from `purok` where `purok`.`deleted_at` is null
select * from `sitio` where `sitio`.`deleted_at` is null
select * from `educational_attaintment` where `educational_attaintment`.`deleted_at` is null
select * from `educational_status` where `educational_status`.`deleted_at` is null
select * from `government_assistance` where `government_assistance`.`deleted_at` is null
select * from `organization` where `organization`.`deleted_at` is null
select * from `occupation` where `occupation`.`deleted_at` is null
select * from `barangay` where `barangay`.`deleted_at` is null

    public function show($id)
    {
        $gads = Gad::where('household_no', $id)->get();
        $gad = Gad::where('household_no', $id)->first();
        foreach ($gads as $gad) {
            $gad->id = !empty($gad->id) ? $gad->id : '';
            $gad->full_name = $gad->last_name . ' , ' . $gad->first_name . ' ' . $gad->middle_name;
            $gad->gender_name = !empty($gad->genders) ? $gad->genders->gender_name : '';
            $gad->gender_preference_name = !empty($gad->gender_preference) ?  $gad->gender_preference : '';
            $gad->sector_name = !empty($gad->sector) ? $gad->sector->sector_name : '';
            $gad->barangay = !empty($gad->barangay) ? $gad->barangay : '';
            $gad->age = !empty($gad->age) ? $gad->age : '';

            $gad->household_names = !empty($gad->household) ? $gad->household->household_name : '';
            $gad->civil_status_names = !empty($gad->civil_status) ? $gad->civil_status->civil_status_name : '';
            $gad->purok_names =  !empty($gad->purok) ? $gad->purok->purok_name : '';
            $gad->sitio_names =  !empty($gad->sitio) ? $gad->sitio->sitio_name : '';
            $gad->native_citys =  !empty($gad->native_city) ? $gad->native_city->city_name : '';
            $gad->native_provinces =  !empty($gad->native_province) ? $gad->native_province->province_name : '';
            $gad->work_location_citys =  !empty($gad->work_location_city) ? $gad->work_location_city->city_name : '';
            $gad->work_location_provinces =  !empty($gad->work_location_province) ? $gad->work_location_province->province_name : '';
            $gads->valid_id_names =  !empty($gads->validId) ? $gads->validId->name : '';
            $gads->educational_attaintment_name =  !empty($gads->educational_attaintment) ? $gads->educational_attaintment->educational_attaintment_name : '';
            $gads->educational_status_name =  !empty($gads->educational_status) ? $gads->educational_status->educational_status_name : '';
            $gads->government_assistance_name =  !empty($gads->government_assistance) ? $gads->government_assistance->government_assistance_name : '';
            $gad->political_province_registered =  !empty($gad->political_province_registered) ? $gad->political_province_registered->city_name : '';
            $gad->political_city_registered =  !empty($gad->political_city_registered) ? $gad->political_city_registered->city_name : '';
            $gads->house_ownership_names =  !empty($gads->house_ownership) ? $gads->house_ownership->house_ownership_name : '';
            $gads->house_make_names =  !empty($gads->house_make) ? $gads->house_make->house_make_name : '';
            $gads->house_type_names =  !empty($gads->house_type) ? $gads->house_type->house_type_name : '';
            $utilities1 = Utilities::where('id', $gad->utilities_no1)->first();
            $utilities2 = Utilities::where('id', $gad->utilities_no2)->first();
            $utilities3 = Utilities::where('id', $gad->utilities_no3)->first();
            $utilities4 = Utilities::where('id', $gad->utilities_no4)->first();
---
select * from `gad` where `household_no` = '1' and `gad`.`deleted_at` is null
select * from `gad` where `household_no` = '1' and `gad`.`deleted_at` is null limit 1
select * from `utilities` where `id` is null and `utilities`.`deleted_at` is null limit 1

            $gad->gad_utilities_no2 = !empty($utilities2) ? $utilities2->utilities_name : '';
            $gad->gad_utilities_no3 = !empty($utilities3) ? $utilities3->utilities_name : '';
            $gad->gad_utilities_no4 = !empty($utilities4) ? $utilities4->utilities_name : '';
            $appliances1 = Appliances::where('id', $gad->appliances_no1)->first();
            $appliances2 = Appliances::where('id', $gad->appliances_no2)->first();
            $appliances3 = Appliances::where('id', $gad->appliances_no3)->first();
            $appliances4 = Appliances::where('id', $gad->appliances_no4)->first();
---
select * from `appliance` where `id` is null and `appliance`.`deleted_at` is null limit 1

            'remarks' => $request->remark,
        ];

        $model_media_type = Media::where('model_type', Gad::class)->where('model_id', $gad->id)->first();
---
select * from `media` where `model_type` = 'App\Models\Gad' and `model_id` = 1 limit 1

                    ->update(['model_id' => $gad->id]);
            }
        }
        $gad->update($data);
---
update `gad` set `valid_id` = '{\"id\":\"5\",\"name\":\"Senior Citizen ID\",\"created_at\":\"2021-07-08 22:45:41\",\"updated_at\":\"2021-07-08 22:45:41\",\"deleted_at\":null}', `economic_status_id` = '', `gad`.`updated_at` = '2022-05-22 13:57:23' where `id` = 1

    public function edit($id)
    {
        $gad = Gad::find($id);
        $gad->id = !empty($gad->id) ? $gad->id : '';
        $gad->full_name = $gad->last_name . ' , ' . $gad->first_name . ' ' . $gad->middle_name;
        $gad->gender_name = !empty($gad->genders) ? $gad->genders->gender_name : '';
        $gad->gender_preference_name = !empty($gad->gender_preference) ? $gad->gender_preference->gender_preference_name : '';
        $gad->sector_name = !empty($gad->sector) ? $gad->sector->sector_name : '';
        $gad->barangays_name = !empty($gad->barangay) ? $gad->barangay->barangay_name : '';
        $gad->age = !empty($gad->age) ? $gad->age : '';
        $gad->ethnicity_name = !empty($gad->ethnicity) ? $gad->ethnicity->ethnicity_name : '';

        $gad->household_names = !empty($gad->household) ? $gad->household->household_name : '';
        $gad->civil_status_names = !empty($gad->civil_status) ? $gad->civil_status->civil_status_name : '';
        $gad->purok_names =  !empty($gad->purok) ? $gad->purok->purok_name : '';
        $gad->sitio_names =  !empty($gad->sitio) ? $gad->sitio->sitio_name : '';
        $gad->native_citys =  !empty($gad->native_city) ? $gad->native_city->city_name : '';
        $gad->native_provinces =  !empty($gad->native_province) ? $gad->native_province->province_name : '';
        $gad->work_location_citys =  !empty($gad->work_location_city) ? $gad->work_location_city->city_name : '';
        $gad->work_location_provinces =  !empty($gad->work_location_province) ? $gad->work_location_province->province_name : '';
        $gad->valid_id_names =  !empty($gad->validId) ? $gad->validId->name : '';
        $gad->educational_attaintment_name =  !empty($gad->educational_attaintment) ? $gad->educational_attaintment->educational_attaintment_name : '';
        $gad->educational_status_name =  !empty($gad->educational_status) ? $gad->educational_status->educational_status_name : '';
        $gad->government_assistance_name =  !empty($gad->government_assistance) ? $gad->government_assistance->government_assistance_name : '';
        $gad->political_province_registered =  !empty($gad->political_province_registered) ? $gad->political_province_registered->province_name : '';
        $gad->political_city_registered =  !empty($gad->political_city_registered) ? $gad->political_city_registered->city_name : '';
        $gad->house_ownership_names =  !empty($gad->house_ownership) ? $gad->house_ownership->house_ownership_name : '';
        $gad->house_make_names =  !empty($gad->house_make) ? $gad->house_make->house_make_name : '';
        $gad->house_type_names =  !empty($gad->house_type) ? $gad->house_type->house_type_name : '';
        $utilities1 = Utilities::where('id', $gad->utilities_no1)->first();
        $utilities2 = Utilities::where('id', $gad->utilities_no2)->first();
        $utilities3 = Utilities::where('id', $gad->utilities_no3)->first();
        $utilities4 = Utilities::where('id', $gad->utilities_no4)->first();
---
select * from `gad` where `gad`.`id` = '1' and `gad`.`deleted_at` is null limit 1
select * from `utilities` where `id` = '1' and `utilities`.`deleted_at` is null limit 1
select * from `utilities` where `id` = '4' and `utilities`.`deleted_at` is null limit 1
select * from `utilities` where `id` is null and `utilities`.`deleted_at` is null limit 1

        $gad->gad_utilities_no2 = !empty($utilities2) ? $utilities2->utilities_name : '';
        $gad->gad_utilities_no3 = !empty($utilities3) ? $utilities3->utilities_name : '';
        $gad->gad_utilities_no4 = !empty($utilities4) ? $utilities4->utilities_name : '';
        $appliances1 = Appliances::where('id', $gad->appliances_no1)->first();
        $appliances2 = Appliances::where('id', $gad->appliances_no2)->first();
        $appliances3 = Appliances::where('id', $gad->appliances_no3)->first();
        $appliances4 = Appliances::where('id', $gad->appliances_no4)->first();
---
select * from `appliance` where `id` is null and `appliance`.`deleted_at` is null limit 1