app/Http/Controllers/Api/V1/Admin/ReportsApiController.php

select * from `barangay` where `barangay`.`deleted_at` is null
select * from `sector` where `sector`.`deleted_at` is null
select * from `gender` where `gender`.`deleted_at` is null
---
    public function create(Request $request)
    {
        $barangays = Barangay::all();
        $sector = Sector::all();
        $gender = Gender::all();

select count(*) as aggregate from `gad` where (`barangay_id` = 26 or `sector_id` = '' or `sitio_id` = '' or `gender_id` = '') and `gad`.`deleted_at` is null
select * from `gad` where (`barangay_id` = 26 or `sector_id` = '' or `sitio_id` = '' or `gender_id` = '') and `gad`.`deleted_at` is null order by `gender_id` desc
---
    public function getData(Request $request)
    {
        $barangay_id = !empty($request->barangay) ? json_decode($request->barangay)->id : '';
        $purok_id = !empty($request->purok) ? json_decode($request->purok)->id : '';
        $sitio_id = !empty($request->sitio) ? json_decode($request->sitio)->id : '';
        $sector_id = !empty($request->sector) ? json_decode($request->sector)->id : '';
        $gender_id =  !empty($request->gender) ? json_decode($request->gender)->id : '';
        $age_from = !empty($request->age_from) ? $request->age_from : '';
        $age_to = !empty($request->age_to) ? $request->age_to : '';
        $gads = Gad::where('barangay_id', $barangay_id)
            ->orWhere('sector_id', $sector_id)
            ->orWhere('sitio_id', $sitio_id)
            ->orWhere('gender_id', $gender_id)
            ->orderBy('gender_id', 'DESC')
            ->paginate();

select count(*) as aggregate from `gad` where (`barangay_id` = 26 or `sector_id` = '' or `sitio_id` = '' or `gender_id` = '2') and `gad`.`deleted_at` is null
---

        if ($gender_id) {
            if ($gender_id == '1') {
                $male = Gad::where('barangay_id', $barangay_id)
                    ->orWhere('sector_id', $sector_id)
                    ->orWhere('sitio_id', $sitio_id)
                    ->orWhere('gender_id', $gender_id)
                    ->orderBy('gender_id', 'DESC')
                    ->count();